Revit 2027 API
StructuralSectionUtils Class
 This class provides utilities related to Structural Section Properties.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class StructuralSectionUtils
Public NotInheritable Class StructuralSectionUtils
public ref class StructuralSectionUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralSectionUtils = class end
The StructuralSectionUtils type exposes the following members.
Methods
Name | Description
GetStructuralElementDefinitionData |  Return structural element definition data.
GetStructuralSection |  Return structural section from element.
SetStructuralSection |  Set structural section in element.
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace